### Capital Asset Pricing Model - INFY,NIFTY

In [1]:
import numpy as np
import pandas as pd
import nsepy as nse
import matplotlib.pyplot as plt

In [2]:
from nsepy import get_history
from datetime import date

In [3]:
INFY = nse.get_history(symbol = 'infy', index = False, start = date(2018, 1, 1), end = date(2023, 3, 23))['Close']
INFY

Date
2018-01-01    1033.55
2018-01-02    1029.70
2018-01-03    1021.30
2018-01-04    1015.40
2018-01-05    1012.00
               ...
2023-03-17    1420.70
2023-03-20    1403.65
2023-03-21    1390.70
2023-03-22    1389.25
2023-03-23    1374.55
Name: Close, Length: 1296, dtype: float64

In [4]:
NIFTY = nse.get_history(symbol = 'NIFTY', index = True, start = date(2018, 1, 1), end = date(2023, 3, 23))['Close']
NIFTY

Date
2018-01-01    10435.55
2018-01-02    10442.20
2018-01-03    10443.20
2018-01-04    10504.80
2018-01-05    10558.85
                ...
2023-03-17    17100.05
2023-03-20    16988.40
2023-03-21    17107.50
2023-03-22    17151.90
2023-03-23    17076.90
Name: Close, Length: 1296, dtype: float64

In [5]:
sec_data = pd.concat([INFY, NIFTY], axis = 1)
sec_data

              Close     Close
Date
2018-01-01  1033.55  10435.55
2018-01-02  1029.70  10442.20
2018-01-03  1021.30  10443.20
2018-01-04  1015.40  10504.80
2018-01-05  1012.00  10558.85
...             ...       ...
2023-03-17  1420.70  17100.05
2023-03-20  1403.65  16988.40
2023-03-21  1390.70  17107.50
2023-03-22  1389.25  17151.90
2023-03-23  1374.55  17076.90

[1296 rows x 2 columns]

In [6]:
sec_data.columns = ['INFY', 'NIFTY']
sec_data

               INFY     NIFTY
Date
2018-01-01  1033.55  10435.55
2018-01-02  1029.70  10442.20
2018-01-03  1021.30  10443.20
2018-01-04  1015.40  10504.80
2018-01-05  1012.00  10558.85
...             ...       ...
2023-03-17  1420.70  17100.05
2023-03-20  1403.65  16988.40
2023-03-21  1390.70  17107.50
2023-03-22  1389.25  17151.90
2023-03-23  1374.55  17076.90

[1296 rows x 2 columns]

In [7]:
sec_returns = np.log(sec_data/sec_data.shift(1))
sec_returns

                INFY     NIFTY
Date
2018-01-01       NaN       NaN
2018-01-02 -0.003732  0.000637
2018-01-03 -0.008191  0.000096
2018-01-04 -0.005794  0.005881
2018-01-05 -0.003354  0.005132
...              ...       ...
2023-03-17  0.011753  0.006715
2023-03-20 -0.012074 -0.006551
2023-03-21 -0.009269  0.006986
2023-03-22 -0.001043  0.002592
2023-03-23 -0.010638 -0.004382

[1296 rows x 2 columns]

In [8]:
cov = sec_returns.cov()*250
cov

           INFY     NIFTY
INFY   0.167295  0.030587
NIFTY  0.030587  0.036924

In [9]:
cov_with_market = cov.iloc[0,1]
cov_with_market

0.030586984998109336

In [11]:
market_var = sec_returns['NIFTY'].var()*250
market_var

0.03692376322070834

### Beta

### $$ 
\beta_{pg} = \frac{\sigma_{pg,m}}{\sigma_{m}^2}
$$

In [12]:
INFY_beta = cov_with_market/market_var
INFY_beta

0.8283821130386547

### Calculating Expected Return of INFY (CAPM)

In [18]:
INFY_ER = 0.0686 + INFY_beta * 0.0973
INFY_ER

0.1492015795986611

https://pages.stern.nyu.edu/~adamodar/New_Home_Page/datafile/ctryprem.html

### Sharpe Ratio

In [21]:
Sharpe = (INFY_ER - 0.0686)/(sec_returns['INFY'].std()*250**0.5)

In [22]:
Sharpe

0.19706169062300039